#include<stdio.h>
//利用共用体（union）和字节序（端序）的特性来检测当前系统是小端模式还是大端模式。
union ifBigorSmall{
	int i;
	char j;
};

int main(){
	union ifBigorSmall s;
	s.i=1;
	
	if(s.j==1){
		printf("小端模式\n");
	}else{
		printf("大端模式\n");
	}
	return 0;
}

//大端模式
// text
// 地址：  1000    1001    1002    1003
       // ┌────┬────┬────┬────┐
       // │0x00│0x00│0x00│0x01│
       // └────┴────┴────┴────┘
         // ↑高字节       ↑低字节
// 低地址 1000 中放的是高字节 0x00

// 小端模式
// text
// 地址：  1000    1001    1002    1003
       // ┌────┬────┬────┬────┐
       // │0x01│0x00│0x00│0x00│
       // └────┴────┴────┴────┘
         // ↑低字节       ↑高字节
// 低地址 1000 中放的是低字节 0x01